app/views/washes/_form.html.erb

SELECT "vehicles".* FROM "vehicles"
---
    <%= f.label :vehicle_id %><br>
    <%= collection_select(:wash, :vehicle_id, Vehicle.all, :id, :full_nameauto) %>

SELECT "employees".* FROM "employees"
---
    <%= f.label :employee_id %><br>
    <%= collection_select(:wash, :employee_id, Employee.all, :id, :full_name) %>

SELECT "customers".* FROM "customers"
---
    <%= f.label :customer_id %><br>
    <%= collection_select(:wash, :customer_id, Customer.all, :id, :full_name) %>