app/views/customers/index.html.erb

        <td><%= customer.dni %></td>
        <td><%= link_to "Ver Lavado (#{customer.washes.count})", washes_path(:customer_id => customer.id) %></td>
---
SELECT COUNT(*) FROM "washes" WHERE "washes"."customer_id" = ?  [["customer_id", 1]]