app/controllers/customers_controller.rb

  def create
    @customer = Customer.new(customer_params)

    respond_to do |format|
      if @customer.save
---
INSERT INTO "customers" ("first_name", "last_name", "dni", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["first_name", "Cristian"], ["last_name", "Flores"], ["dni", 35782666], ["created_at", "2015-05-06 02:19:53.722029"], ["updated_at", "2015-05-06 02:19:53.722029"]]