app/controllers/employees_controller.rb

  def index
    @employees = Employee.all
    @employees = @employees.joins(:washes).joins("join vehicles on (washes.vehicle_id = vehicles.id)").where("vehicles.id = ?", params[:vehicle_id]) if params[:vehicle_id]
---
SELECT "employees".* FROM "employees"
SELECT "employees".* FROM "employees" INNER JOIN "washes" ON "washes"."employee_id" = "employees"."id" join vehicles on (washes.vehicle_id = vehicles.id) WHERE (vehicles.id = '1')

  def create
    @employee = Employee.new(employee_params)

    respond_to do |format|
      if @employee.save
---
INSERT INTO "employees" ("first_name", "last_name", "dni", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["first_name", "Mario"], ["last_name", "Tejerina"], ["dni", 35782633], ["created_at", "2015-05-06 02:18:22.818581"], ["updated_at", "2015-05-06 02:18:22.818581"]]