app/controllers/vehicles_controller.rb

SELECT "vehicles".* FROM "vehicles"
---
  def index
    @vehicles = Vehicle.all

INSERT INTO "vehicles" ("brand", "model", "patent", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["brand", "Fiat"], ["model", "Uno"], ["patent", "12we4"], ["created_at", "2015-05-06 02:21:42.281154"], ["updated_at", "2015-05-06 02:21:42.281154"]]
---
  def create
    @vehicle = Vehicle.new(vehicle_params)

    respond_to do |format|
      if @vehicle.save

SELECT  "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_vehicle
      @vehicle = Vehicle.find(params[:id])