app/controllers/washes_controller.rb

SELECT "washes".* FROM "washes" INNER JOIN "employees" ON "employees"."id" = "washes"."employee_id"  ORDER BY employees.first_name
SELECT "washes".* FROM "washes"  ORDER BY "washes"."date" ASC
SELECT "washes".* FROM "washes" WHERE "washes"."customer_id" = ?  [["customer_id", 1]]
---
  def index

    if params[:cliente]
      @washes = Wash.joins(:customer).order("customers.first_name")
    elsif params[:vehiculo]
      @washes = Wash.joins(:vehicle).order("vehicles.brand")
    elsif params[:empleado]
        @washes = Wash.joins(:employee).order("employees.first_name")
    elsif params[:fecha]
        @washes = Wash.order(:date)
    else
      @washes = Wash.all

INSERT INTO "washes" ("amount", "vehicle_id", "employee_id", "customer_id", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["amount", 120.5], ["vehicle_id", 1], ["employee_id", 2], ["customer_id", 2], ["date", "2015-05-09"], ["created_at", "2015-05-06 03:04:23.674448"], ["updated_at", "2015-05-06 03:04:23.674448"]]
---
  def create
    @wash = Wash.new(wash_params)

    respond_to do |format|
      if @wash.save

UPDATE "washes" SET "date" = ?, "updated_at" = ? WHERE "washes"."id" = ?  [["date", "2020-05-01"], ["updated_at", "2015-05-14 02:55:18.608674"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @wash.update(wash_params)

SELECT  "washes".* FROM "washes" WHERE "washes"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_wash
      @wash = Wash.find(params[:id])