app/views/vehicles/index.html.erb

SELECT COUNT(*) FROM "washes" WHERE "washes"."vehicle_id" = ?  [["vehicle_id", 1]]
---
        <td><%= vehicle.patent %></td>
        <td><%= vehicle.washes.count %></td>